fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьПревышениеОстатков(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого СтрокаВыплаты Из Выплаты Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = СтрокаВыплаты.Сотрудник;
		Движение.Сумма = СтрокаВыплаты.Сумма;
		
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет, что сумма выплаты по сотруднику не превышает остаток взаиморасчетов
// на дату документа.
//
// Параметры:
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПроверитьПревышениеОстатков(Отказ)
	
	Если Выплаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммыПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаВыплаты Из Выплаты Цикл
		ТекущаяСумма = СуммыПоСотрудникам[СтрокаВыплаты.Сотрудник];
		Если ТекущаяСумма = Неопределено Тогда
			ТекущаяСумма = 0;
		КонецЕсли;
		СуммыПоСотрудникам[СтрокаВыплаты.Сотрудник] = ТекущаяСумма + СтрокаВыплаты.Сумма;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СуммаКОплате = СуммыПоСотрудникам[Выборка.Сотрудник];
		Если СуммаКОплате = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СуммаКОплате > Выборка.Сумма + 0.005 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Выплаты";
			Сообщение.Текст = СтрШаблон(
				"Сумма выплаты сотруднику %1 превышает остаток взаиморасчетов (%2).",
				Выборка.Сотрудник, Формат(Выборка.Сумма, "ЧДЦ=2"));
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет табличную часть Выплаты остатками взаиморасчетов с сотрудниками
// на дату документа.
//
Процедура ЗаполнитьВыплаты() Экспорт
	
	Выплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВзаиморасчетыССотрудникамиОстатки
		|ГДЕ
		|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Выплаты.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.Сумма = Выборка.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
